app/views/portfolios/show.html.erb

SELECT "techologies".* FROM "techologies" WHERE "techologies"."portfolio_id" = $1  [["portfolio_id", 3]]
---
      <h3>Technologies Used:</h3>
      <% @portfolio_item.techologies.each do |t| %>