app/controllers/blogs_controller.rb

  def index
    @blogs = Blog.page(params[:page]).per(5)
---
SELECT "blogs".* FROM "blogs" LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "blogs"

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "test title"], ["body", "test content"], ["created_at", "2020-07-01 13:27:18.625483"], ["updated_at", "2020-07-01 13:27:18.625483"], ["slug", "test-title"]]

  def update
    respond_to do |format|
      if @blog.update(blog_params)
---
UPDATE "blogs" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "TEST TITLE 3"], ["body", "TEST CONTENT 3"], ["updated_at", "2020-07-01 13:39:52.983881"], ["id", 15]]