app/controllers/portfolios_controller.rb

  def index
    # we can reach angular method from portfolio model. We created a query from there and we can reach from here
    # without writing any query.
    # @portfolio_items = Portfolio.angular
    # @portfolio_items = Portfolio.ruby_on_rails_portfolio_items
    @portfolio_items = Portfolio.all
---
SELECT "portfolios".* FROM "portfolios" ORDER BY position ASC

  def show
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def create
    @portfolio_item = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body))

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def edit
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @portfolio_item = Portfolio.find(params[:id])
    respond_to do |format|
      if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
UPDATE "portfolios" SET "title" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["title", "getegea"], ["updated_at", "2020-06-27 11:42:02.103553"], ["id", 15]]

  def destroy
    @portfolio_item = Portfolio.find(params[:id])
    @portfolio_item.destroy
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 10]]